# Pokemon

### Introduction:

This time you will create the data.



### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Create a data dictionary that looks like the DataFrame below

In [ ]:
d={"name":['Bulbasaur','Charmander','squirtle','Caterpie'],"evolution":['Ivysaur','Charmeleon','Wartortle','Metapod'],"type":['grass','fire','water','bug'],"pokedex":['yes','no','yes','no'],"hp":[45,39,44,45]}
d

{'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
 'hp': [45, 39, 44, 45],
 'name': ['Bulbasaur', 'Charmander', 'squirtle', 'Caterpie'],
 'pokedex': ['yes', 'no', 'yes', 'no'],
 'type': ['grass', 'fire', 'water', 'bug']}

### Step 3. Assign it to a variable called pokemon

In [ ]:
pokemon=pd.Series(d)
pokemon

name         [Bulbasaur, Charmander, squirtle, Caterpie]
evolution      [Ivysaur, Charmeleon, Wartortle, Metapod]
type                           [grass, fire, water, bug]
pokedex                               [yes, no, yes, no]
hp                                      [45, 39, 44, 45]
dtype: object

### Step 4. Ops...it seems the DataFrame columns are in alphabetical order. Place  the order of the columns as name, type, hp, evolution, pokedex

In [ ]:
p1=pd.DataFrame.from_dict(d)

In [ ]:
p1

         name   evolution   type pokedex  hp
0   Bulbasaur     Ivysaur  grass     yes  45
1  Charmander  Charmeleon   fire      no  39
2    squirtle   Wartortle  water     yes  44
3    Caterpie     Metapod    bug      no  45

In [ ]:
p2=p1[["name","type","hp","evolution","pokedex",]]
p2

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

### Step 5. Add another column called place, and insert what you have in mind.

In [ ]:
place=["market","mall","Hospital","college"]
place

['market', 'mall', 'Hospital', 'college']

In [ ]:
p1["place"]=place
p1

         name   evolution   type pokedex  hp     place
0   Bulbasaur     Ivysaur  grass     yes  45    market
1  Charmander  Charmeleon   fire      no  39      mall
2    squirtle   Wartortle  water     yes  44  Hospital
3    Caterpie     Metapod    bug      no  45   college

### Step 6. Present the type of each column

In [ ]:
p1.dtypes

name         object
evolution    object
type         object
pokedex      object
hp            int64
place        object
dtype: object

### BONUS: Create your own question and answer it.

In [ ]:
## extract column of name from above dataframe
p1["name"]

0     Bulbasaur
1    Charmander
2      squirtle
3      Caterpie
Name: name, dtype: object